Repository: pdir/pwa-bundle
Catalog: src/Resources/contao/languages/*/*_pwa_config.xlf
Languages: de

# tl_pwa_config.manifest_legend
source: Manifest Einstellungen
de: Manifest settings

# tl_pwa_config.createManifest.0
source: Enable manifest
de: Manifest aktivieren

# tl_pwa_config.createManifest.1
source: Enable manifest creation for this root page
de: Manifest Generierung für diese Startseite aktivieren

# tl_pwa_config.manifestAlias.0
source: Manifest file name
de: Manifest Dateiname

# tl_pwa_config.manifestAlias.1
source: Please enter the name of the manifest file without extension.
de: Bitte geben Sie hier den Manifest Dateinamen ohne Dateiendung an.

# tl_pwa_config.manifestBackgroundColor.0
source: Background color
de: Hintergrundfarbe

# tl_pwa_config.manifestBackgroundColor.1
source: Defines the expected "background color" for the website. This value repeats what is already available in the site’s CSS, but can be used by browsers to draw the background color of a shortcut when the manifest is available before the stylesheet has loaded. This creates a smooth transition between launching the web application and loading the site's content.
de: Definiert die erwartete Hintergrundfarbe für die Webanwendung. Dieser Wert wiederholt, was bereits im Anwendungsstylesheet verfügbar ist, kann aber von Browsern verwendet werden, um die Hintergrundfarbe einer Webanwendung zu zeichnen, wenn das Manifest verfügbar ist, bevor das Stylesheet geladen ist. Dies schafft einen reibungslosen Übergang zwischen dem Starten der Webanwendung und dem Laden des Inhalts der Anwendung.

# tl_pwa_config.manifestDescription.0
source: Description
de: Beschreibung

# tl_pwa_config.manifestDescription.1
source: Provides a general description of what the pinned website does.
de: Bietet eine allgemeine Beschreibung dessen, was die Web-Anwendung tut.

# tl_pwa_config.manifestDir.0
source: Text direction
de: Textrichtung

# tl_pwa_config.manifestDir.1
source: Specifies the primary text direction for the name, short_name, and description members. Together with the lang member, it helps the correct display of right-to-left languages.
de: Definiert die primäre Textrichtung für die name, short_name und description Eigenschaften. Zusammen mit der lang Eigenschaft kann es helfen, die korrekte Darstellung von rechts-nach-links-Sprachen zu liefern.

# tl_pwa_config.manifestDisplay.0
source: Display mode
de: Anzeigemodus

# tl_pwa_config.manifestDisplay.1
source: Defines the developers preferred display mode for the website.
de: Definiert den vom Entwickler bevorzugten Anzeigemodus für die Webanwendung.

# tl_pwa_config.manifestIcons.0
source: Icons
de: Symbole

# tl_pwa_config.manifestIcons.1
source: Specifies an array of image files that can serve as application icons, depending on context. For example, they can be used to represent the web application amongst a list of other applications, or to integrate the web application with an OS's task switcher and/or system preferences.
de: Gibt ein Array von Bildobjekten an, die als Anwendungssymbole in verschiedenen Kontexten dienen können. Zum Beispiel können sie verwendet werden, um die Webanwendung unter einer Liste anderer Anwendungen darzustellen oder die Webanwendung mit einem Task-Switcher und / oder Systemeinstellungen eines Betriebssystems zu integrieren.

# tl_pwa_config.manifestName.0
source: Name
de: App Name

# tl_pwa_config.manifestName.1
source: Provides a human-readable name for the site when displayed to the user.
de: Stellt einen menschlich lesbaren Namen für die Anwendung bereit, wie sie dem Benutzer angezeigt werden soll, zum Beispiel unter einer Liste anderer Anwendungen oder als Label für ein Symbol.

# tl_pwa_config.manifestOrientation.0
source: Default orientation
de: Standardausrichtung

# tl_pwa_config.manifestOrientation.1
source: Defines the default orientation for all the website's top level browsing contexts.
de: Definiert die Standardausrichtung für alle Top-Level der Webanwendung Browsing-Kontexte.

# tl_pwa_config.manifestShortName.0
source: Short name
de: Kurzname

# tl_pwa_config.manifestShortName.1
source: Provides a short human-readable name for the application. This is intended for when there is insufficient space to display the full name of the web application, like device homescreens.
de: Bietet einen kurzen menschlich lesbaren Namen für die Anwendung. Dies ist für den Einsatz vorgesehen, wo nicht genügend Platz vorhanden ist, um den vollständigen Namen der Webanwendung anzuzeigen.

# tl_pwa_config.manifestStartUrl.1
source: The URL that loads when a user launches the application (e.g. when added to home screen), typically the index. Note that this has to be a relative URL, relative to the manifest url.
de: Gibt die URL an, die geladen wird, wenn ein Benutzer die Anwendung von einem Gerät startet (bspw. vom startbildschirm seines Smartphones). Wenn als relative URL angegeben, ist die Basis-URL die URL des Manifests.

# tl_pwa_config.manifestThemeColor.0
source: Theme color
de: Standardfarbe des Themes

# tl_pwa_config.manifestThemeColor.1
source: Defines the default theme color for an application. This sometimes affects how the OS displays the site (e.g., on Android's task switcher, the theme color surrounds the site).
de: Definiert die Standardthemafarbe für eine Anwendung. Dies beeinflusst manchmal, wie die Anwendung vom Betriebssystem angezeigt wird (z. B. auf Android-Task-Switcher, die Themenfarbe umgibt die Anwendung).
